Revit 2027 API
XYZ.Zero Property
The coordinate origin or zero vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static XYZ Zero { get; }
Public Shared ReadOnly Property Zero As XYZ
	Get
public:
static property XYZ^ Zero {
	XYZ^ get ();
}
static member Zero : XYZ with get
Property Value
XYZ
Remarks
The zero vector is (0,0,0).
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace